In [11]:
import pandas as pd
from pandas import DataFrame, Series

pd.options.display.precision = 3 # pandasでの出力を小数点第3位まで表示

In [13]:
# 別のデータの準備
data = {'ID':['100','101','102','105','107'],
               'Math':[50,43,33,76,98],
               'English':[90,30,20,50,30],
               'Sex':['M','F','F','M','M']}
df = DataFrame(data)
df

    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  105    76       50   M
4  107    98       30   M

In [14]:
df.mean()

ID         2.002e+13
Math       6.000e+01
English    4.400e+01
dtype: float64

In [15]:
df.groupby("Sex").mean()

       Math  English
Sex
F    38.000   25.000
M    74.667   56.667